#+SETUPFILE: setup.org

**** upvalue

 在 pascal 中，在 outer scope 的变量，可以通过 frame stack 去查找

 但是在 lua 中，函数也是一种值，可以四处流转，说不定在什么地方调用
 所以其 upvalue 不一定出现在 stack frame 上


 #+begin_quote
 对象是带函数的值
 闭包是带值的函数
 #+end_quote

 #+begin_src lua :results output
 local function outer()
    local a = 0

    local function inner()
       local b = 0

       a = a + 1
       return a
    end

    inner()

    return inner
 end

 local f = outer()

 print(f())
 print(f())
 print(f())

 local g = outer()

 print(g())
 print(g())
 print(g())
 #+end_src

 #+RESULTS:
 : 2
 : 3
 : 4
 : 2
 : 3
 : 4

 function 作为基础类型之一，可以作为普通变量，参数，返回值，赋值，而四处流转

 这种情况下，和 local 作用域机制在一起，就会出现问题

 a 的作用域在 outer 内部，同时被 inner 引用并修改，最终 outer 返回 inner

 调用 outer，赋值给 f

 按照语义，f 应该是内部的 inner func，每次调用都得到 a 的自增值

 调用 3 次，得到 1 2 3

 问题在于，a 只作用在 outer 内部，而 f 在 outer 外部，已经离开了 a 的作用域，
 在这种情况下如何保证语义的正确？

 这便是闭包机制的由来，a 对于 inner 而言，不是 local，而是 upvalue 类型。

 这也是 lua 中为何 func 不是 func 而是 closure 的原因，func 及 upvalue 组成了 closure，
 所有 func 在运行时都封装为 closure 来运行，其中重要的原因就在于分配 upvalue 空间。

 #+CAPTION: 17 upvalue at runtime

 再调用 outer，赋值给 g，调用 3 次，得到一样的结果，从中可以得到 upvalue 作用于 active 和
 dead 状态的区别。

**** global

 前面提到了 local 变量的作用域，以及 upvalue 出现的原因及解决方法。

 其中隐含的一点，外层变量对于内层可见，假如强制设定外层对于内部不可见，便不会有 upvalue 的问题。

 对于可见的情况，对于当前引用的变量，自然有一个查找的过程。
 和嵌套相反，是层层向上寻找的过程。

 变量
 在本层可以找到的，为 local
 在本层之外可以找到的，为 upvalue
 所有层都无法找到的，为 global

 global 的概念解决了两个细节问题
 为什么顶层的 function 是没有 upvalue 的？
 因为在本层找不到的变量，向上已经没有层级，只能是 global

 setfenv 的概念
 函数的运行环境，即是 global，在编译的 chunk 运行之前，设定 global 的值，
 可以影响内部对 global 值的引用，从而实现不同的运行效果。


 在实现中，global 是单独于基层的 closure 存在的，是运行状态的一部分
 所以不存在作用域的问题，始终在顶层。


 #+begin_src lua :results output
 local function outer()
   a = 10

   local function inner()
     a = a + 1
     return a
   end

   return inner
 end

 local f = outer()

 print(f(), a)
 print(f(), a)
 print(f(), a)
 #+end_src

 #+RESULTS:
 : 11	11
 : 12	12
 : 13	13

 #+CAPTION: 18 global at runtime

*** repeat

repeat    

#+CAPTION: 31 repeat

break 同 while 时的表现相同


不过对于 upval，有自己的处理方式


因为 while 在 cond 中不能定义新的 local var
而 repeat 的 block 中可能先定义 local var
再被其中的 func 引用，而 i 在不断变化，就需要及时 close




#+begin_src lua :results output
local t = {}

local c = 0

repeat
   c = c + 1

   local i = c

   t[i] = function ()
      return i
   end
until i > 10

for i, f in ipairs(t) do
   print(f())
end
#+end_src

#+RESULTS:
#+begin_example
1
2
3
4
5
6
7
8
9
10
11
#+end_example

进行 upval 判断的原因

每个 func 记录的都是 i，但是每次 loop 结束都进行了 close，


#+CAPTION: 31 repeat upval


**** forlist

#+begin_src lua :results output
local g, s = pairs({1,2,3})

for k, v in g, s, nil do
  print(k, v)
end
#+end_src

#+RESULTS:
: 1	1
: 2	2
: 3	3

#+CAPTION: 33 for and upval

upvalue 同 fornum

